In [64]:
import pandas as pd
import numpy as np

In [65]:
conos = pd.DataFrame({
    'sabor': np.array(["mora","vainilla","chocolate","mora","chocolate"]),
    'precio' : np.array([3500,4700,6500,5200,5700,]) 
})
conos

       sabor  precio
0       mora    3500
1   vainilla    4700
2  chocolate    6500
3       mora    5200
4  chocolate    5700

In [66]:
conos ['sabor']

0         mora
1     vainilla
2    chocolate
3         mora
4    chocolate
Name: sabor, dtype: object

In [67]:
conos [['sabor','precio']]

       sabor  precio
0       mora    3500
1   vainilla    4700
2  chocolate    6500
3       mora    5200
4  chocolate    5700

In [68]:
conos [::-1]

       sabor  precio
4  chocolate    5700
3       mora    5200
2  chocolate    6500
1   vainilla    4700
0       mora    3500

In [69]:
conos [0:4:2]

       sabor  precio
0       mora    3500
2  chocolate    6500

In [70]:
conos [1:3]

       sabor  precio
1   vainilla    4700
2  chocolate    6500

In [71]:
conos.sort_values(by='sabor', ascending=True) #organiza ascendete alfabeticamente lo q se selecciono

       sabor  precio
2  chocolate    6500
4  chocolate    5700
0       mora    3500
3       mora    5200
1   vainilla    4700

In [72]:
conos.sort_values(by='sabor', ascending=False) # organiza decendete alfabeticamente

       sabor  precio
1   vainilla    4700
0       mora    3500
3       mora    5200
2  chocolate    6500
4  chocolate    5700

In [73]:
conos.head(2) #veo el comuenzo de la estructura

      sabor  precio
0      mora    3500
1  vainilla    4700

In [74]:
conos.tail(1) #muestra lo ultimo

       sabor  precio
4  chocolate    5700

In [75]:
conos.sample(1) # a la azar

       sabor  precio
2  chocolate    6500

In [76]:
conos.describe()  # entrega los

            precio
count     5.000000
mean   5120.000000
std    1123.387734
min    3500.000000
25%    4700.000000
50%    5200.000000
75%    5700.000000
max    6500.000000

In [77]:
conos.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   sabor   5 non-null      object
 1   precio  5 non-null      int32
dtypes: int32(1), object(1)
memory usage: 192.0+ bytes

In [78]:
conos.index  # indice de las poscion es numerico

RangeIndex(start=0, stop=5, step=1)

In [79]:
conos.iloc[3] #Selecciona solo una celda de interes

sabor     mora
precio    5200
Name: 3, dtype: object

In [80]:
#Actividad
#Seleccione la fila 1 en adelante. La fila 2 a la 4, y la fila 1 y 4

conos[1:]

       sabor  precio
1   vainilla    4700
2  chocolate    6500
3       mora    5200
4  chocolate    5700

In [81]:
conos[2:4]

       sabor  precio
2  chocolate    6500
3       mora    5200

In [82]:
conos.iloc[[1,4]]

       sabor  precio
1   vainilla    4700
4  chocolate    5700

In [83]:
conos['precio'] [2]

6500

In [84]:
conos.iloc[2,1] #utilioza fila y columna

6500

In [85]:
#1.los indices con numeros debemos cambiarle el indice 
conos_i= conos.set_index('sabor', inplace=False)  #osea ya las posiciones son los nombres de los valores 
conos_i

           precio
sabor
mora         3500
vainilla     4700
chocolate    6500
mora         5200
chocolate    5700

In [86]:
conos_i.index

Index(['mora', 'vainilla', 'chocolate', 'mora', 'chocolate'], dtype='object', name='sabor')

In [87]:
conos_i.loc['chocolate']  #ya es con caracteres

           precio
sabor
chocolate    6500
chocolate    5700

In [88]:
conos_i.loc['vainilla']  #ya solo es el precio

precio    4700
Name: vainilla, dtype: int32

In [89]:
#conos mayor a 5k
#Mascara
conos['precio']> 5000

0    False
1    False
2     True
3     True
4     True
Name: precio, dtype: bool

In [91]:
conos[conos['precio']>5000]

       sabor  precio
2  chocolate    6500
3       mora    5200
4  chocolate    5700

In [94]:
#seleccionar rango
conos['precio'] >3000 and <5000

SyntaxError: invalid syntax (2822510408.py, line 2)